{ "input": "You are a professional writing assistant.
Rewrite or continue this text in a clear, concise, and formal tone:
write an email to my boss about being late", "output": "Subject: Notification of Delay

Dear [Boss's Name],

I hope this message finds you well. I am writing to inform you that I will be arriving late to the office today due to [brief explanation of the reason, e.g., unexpected traffic, a personal matter]. I anticipate being there by [expected arrival time].

I apologize for any inconvenience this may cause and appreciate your understanding.

Thank you for your consideration.

Best regards,  
[Your Name]  
[Your Position]", "mode": "Professional" }
{"input":"make a paragraph about a boy finding a hidden door","output":"In the dappled light of the ancient forest, where the sun’s rays filtered through a thick canopy of emerald leaves, young Oliver stumbled upon a peculiar sight. Half-buried beneath a tangle of gnarled roots and fragrant wildflowers, a weathered door stood resolute, its surface mottled with age and adorned with intricate carvings of twisting vines and curious creatures. A shiver of excitement danced along his spine as he brushed away the soft layer of moss, revealing a brass handle that shimmered like a forgotten treasure. The air around him seemed to thrum with possibility; the whispers of the trees urged him closer, and with a hesitant breath, he grasped the handle. It turned with a soft, echoing creak, and the door swung open to reveal a world drenched in colors he had never imagined—radiant flowers that sang in hues of gold and violet, and a sky filled with swirling constellations that twinkled like mischievous eyes. What secrets lay beyond that threshold? Oliver’s heart raced with the thrill of adventure as he stepped forward, leaving behind the familiar world and stepping into the realm of dreams.","mode":"Creative"}
{"input":"email to my boss about being late","output":"Subject: Notification of Delay\n\nDear [Boss\u0027s Name],\n\nI hope this message finds you well. I am writing to inform you that I will be arriving late to the office today due to [brief explanation of the reason, e.g., unexpected traffic, a personal matter]. I anticipate that I will arrive by [expected arrival time].\n\nI apologize for any inconvenience this may cause and appreciate your understanding.\n\nThank you for your consideration.\n\nBest regards,  \n[Your Name]  \n[Your Position]","mode":"Professional"}
{"input":"email about asking for a raise","output":"Subject: Request for Salary Review\n\nDear [Manager\u0027s Name],\n\nI hope this message finds you well. I am writing to formally request a review of my current salary. Over the past [duration], I have taken on additional responsibilities and contributed to several key projects that have positively impacted our team\u0027s performance and the company\u0027s objectives.\n\nI would appreciate the opportunity to discuss my contributions and the potential for a salary adjustment that reflects my efforts and the value I bring to the organization. I am confident that a review of my performance will support my request.\n\nThank you for considering my request. I look forward to our discussion.\n\nSincerely,  \n[Your Name]  \n[Your Position]  \n[Your Contact Information]  ","mode":"Professional"}
{"input":"email about asking for extra credit opportunities","output":"Subject: Inquiry Regarding Extra Credit Opportunities\n\nDear [Instructor\u0027s Name],\n\nI hope this message finds you well. I am writing to inquire about the possibility of additional credit opportunities within the course. As we approach the end of the semester, I have been reflecting on my performance and the areas where I can enhance my understanding and mastery of the material.\n\nDespite my consistent efforts to engage with the coursework, I find myself facing challenges that have impacted my overall performance. I believe that participating in extra credit assignments would not only provide me with the opportunity to improve my grade but also deepen my comprehension of the subject matter. \n\nI am particularly interested in any assignments or projects that align with the course objectives and would allow me to demonstrate my commitment to learning. If there are specific guidelines or requirements for these opportunities, I would greatly appreciate your guidance.\n\nThank you for considering my request. I am eager to take any steps necessary to enhance my academic performance and contribute positively to the class.\n\nSincerely,  \n[Your Name]  \n[Your Student ID]  \n[Your Course Name]  ","mode":"Academic"}
